[
  {
    "id": 1,
    "image": "credit_agricole_group.svg",
    "name": "Crédit Agricole Group",
    "description": "The Crédit Agricole Group is the leading partner of the French economy and one of the largest banking groups in Europe. It is the leading retail bank in Europe as well as the first European asset manager, the first bancassurer in Europe and the third European player in project finance.\n\nBuilt on its strong cooperative and mutual roots, its 147,000 employees and the 30,000 directors of its Local and Regional Banks, the Crédit Agricole Group is a responsible and responsive bank serving 53 million customers, 11,2 million mutual shareholders and 800,000 individual shareholders.\n\nThanks to its universal customer-focused retail banking model – based on the cooperation between its retail banks and their r elated business lines –, the Crédit Agricole Group supports its customers’ projects in France and around the world: day-to-day banking, home loans, consumer finance, savings, insurances, asset management, real estate, leasing and factoring, and corporate and investment banking.\n\nCrédit Agricole also stands out for its dynamic, innovative corporate social responsibility policy, for the benefit of the economy. This policy is based on a pragmatic approach which permeates across the Group and engages each employee.",
    "summary": "International Banking Group",
    "website": "https://www.credit-agricole.com/",
    "contact": "https://www.credit-agricole.com/en/contact-form/your-need",
    "linkedIn": "https://www.linkedin.com/company/credit-agricole/"
  },
  {
    "id": 2,
    "image": "amundi.svg",
    "name": "Amundi",
    "description": "Amundi, the leading European asset manager, ranking among the top 10 global players, offers its 100 million clients - retail, institutional and corporate - a complete range of savings and investment solutions in active and passive management, in traditional or real assets.\n\nWith its six international investment hubs, financial and extra-financial research capabilities and long-standing commitment to responsible investment, Amundi is a key player in the asset management landscape.​\n\nAmundi clients benefit from the expertise and advice of 4,800 employees in more than 35 countries. A subsidiary of the Crédit Agricole group and listed on the stock exchange, Amundi currently manages more than €1.8 trillion of assets.​",
    "summary": "Amundi is the leading European asset manager with more than €1.95 trillion of assets, ranking among the top 10 global players.",
    "website": "https://www.amundi.com/",
    "contact": "https://www.amundi.com.sg/retail/Local-Content/Footer/Contact-Us/Contact-form",
    "linkedIn": "https://www.linkedin.com/company/amundi-"
  },
  {
    "id": 3,
    "image": "azqore.svg",
    "name": "Azqore SA",
    "description": "Azqore, headquartered in Switzerland with a strong presence in Singapore catering to Asian clients, is a global company dedicated to providing comprehensive turnkey solutions for private banks and wealth managers. Our offerings encompass core banking systems, back office operations, and digital services. With a distinguished 30-year track record, Azqore is a trusted provider, holding certifications such as SFA Fintech, OSPAR (ABS list), ISAE 3402 & 3000, ISO9001, ISO27001, Swift Bureau Service, and GDPR compliance.​\n\nFurthermore, Azqore offers consulting services to streamline the transition to our platform and optimize product and service utilization. We operate an open platform, seamlessly connectable with other fintech solutions in our marketplace and compatible with our clients' existing systems. What sets us apart is our unique blend of banking expertise and technological prowess, making us the ideal partner for private banks and wealth managers.​\n\nAs part of a larger financial services group, we have the flexibility to provide solutions across various business lines by collaborating with one or more of our sister companies.​",
    "summary": "SaaS Digital & Core Banking platform, BPO services, for wealth managers​",
    "website": "https://www.azqore.com/",
    "contact": "customer.info@azqore.com",
    "linkedIn": "https://sg.linkedin.com/company/azqore-sa"
  },
  {
    "id": 4,
    "image": "cacib_logo_new.png",
    "name": "Crédit Agricole CIB",
    "description": "Crédit Agricole CIB is the corporate and investment banking arm of Credit Agricole Group, the 10th largest banking group worldwide in terms of balance sheet size (The Banker, July 2023). More than 9,400 employees across Europe, the Americas, Asia-Pacific, the Middle East and Africa support the Bank's clients, meeting their financial needs throughout the world. Crédit Agricole CIB offers its large corporate and institutional clients a range of products and services in capital markets activities, investment banking, structured finance, commercial banking and international trade. The Bank is a pioneer in the area of climate finance, and is currently a market leader in this segment with a complete offer for all its clients.",
    "summary": "Crédit Agricole CIB is the corporate and investment banking arm of Credit Agricole Group",
    "website": "https://www.ca-cib.com/",
    "contact": "https://www.ca-cib.com/contact-us",
    "linkedIn": "https://www.linkedin.com/company/credit-agricole-cib"
  },
  {
    "id": 5,
    "image": "caceis.svg",
    "name": "CACEIS",
    "description": "CACEIS is the asset servicing banking group of Crédit Agricole and Santander dedicated to asset managers, insurance companies, pension funds, banks, private equity and real estate funds, brokers and corporate clients. Through offices across Europe, North and South America, and Asia, CACEIS offers a broad range of services covering execution, clearing, forex, securities lending, custody, depositary and fund administration, transfer agency, fund distribution support, middle office outsourcing and issuer services. With assets under custody of €4.6 trillion and assets under administration of €3.3 trillion, CACEIS is a European leader in asset servicing and one of the major players worldwide (figures as of 31 July 2023).​",
    "summary": "CACEIS is an asset servicing banking group specialising in added-value financial services for all asset classes.",
    "website": "https://www.caceis.com/",
    "contact": "\nstephenie.so@caceis.com\nmichele.tuen@caceis.com",
    "linkedIn": "https://www.linkedin.com/company/caceis"
  },
  {
    "id": 6,
    "image": "iwm_brown.svg",
    "name": "Indosuez Wealth Management",
    "description": "Key services include: Access to key Asian markets • Asian mandates and local currencies • Private equity • Credit solutions • Wealth structuring • Discretionary portfolio management • Mutual funds • Structured products • Advisory mandates • Hedge funds advisory mandates • Forex and precious metals • Insurance premium financing (IPF) • Sustainable investing (ESG)\n\nIndosuez Wealth Management ranked 10th largest bank in the world based on balance sheet (The Banker 2022). We bring families and entrepreneurs a human-scale organization backed by one of Europe’s largest and most robust universal banking groups.\n\nShaped by more than 145 years of experience supporting families and entrepreneurs around the world, Indosuez Wealth Management offers a tailor-made approach that allows our clients to protect and develop their wealth in alignment with their aspirations. Its teams take a comprehensive view and provide expert advice and exceptional service, offering a wide range of services for the management of both personal and business assets.\n\nRenowned for its international reach combined with a human scale, Indosuez Wealth Management employs about 3,000 people in Europe, Asia-Pacific and the Middle East.",
    "summary": "Indosuez Wealth Management is the global wealth management brand of Crédit Agricole Group",
    "website": "https://singapore.ca-indosuez.com/",
    "contact": "https://singapore.ca-indosuez.com/contact",
    "linkedIn": "https://fr.linkedin.com/company/indosuez-wealth-management"
  }
]
